// Тема 16 (1)

/* # 1.
    Создать двумерный массив 3х3.
    Заполнить его дробными числами от 0 до 20.
    Оформить вывод на экран всех чисел.
    Добавить возможность замены значения пользователем.
    Вывод нового массива. */

//Random random = new Random();
//double[,] mas = new double[3, 3];
//for (int i = 0; i < mas.GetLength(0); i++)
//{
//    for (int j = 0; j < mas.GetLength(1); j++)
//    {
//        mas[i, j] = random.NextDouble() * 20;
//        Console.Write($"{mas[i, j]:F2} ");
//    }
//    Console.WriteLine();
//}
//Console.WriteLine();
//Console.Write($"Введите номер строки (<= {mas.GetLength(0)}): ");
//int n = int.Parse(Console.ReadLine());
//Console.Write($"Введите номер столбца (<= {mas.GetLength(0)}): ");
//int m = int.Parse(Console.ReadLine());
//Console.Write("Введите новое значение: ");
//int k = int.Parse(Console.ReadLine());
//Console.WriteLine();
//mas[n - 1, m - 1] = k;
//for (int i = 0; i < mas.GetLength(0); i++)
//{
//    for (int j = 0; j < mas.GetLength(1); j++)
//    {
//        Console.Write($"{mas[i, j]:F2} ");
//    }
//    Console.WriteLine();
//}


/* # 2. 
    Создать массив символов 5х2.
    Заполнить его символами по желанию в разнобой.
    Вывести на экран понятное слово. */

//char[,] mas =
//{
//    { 'р', '!' },
//    { 'а', 'р' },
//    { 'п', 'м' },
//    { 'г', 'о' },
//    { 'м', 'а' }
//};
//Console.WriteLine($"{mas[2, 0]}{mas[0, 0]}{mas[3, 1]}{mas[3, 0]}{mas[1, 1]}{mas[4, 1]}{mas[2, 1]}{mas[4, 0]}{mas[1, 0]}{mas[0, 1]}");
