// Тема 8

/*      Заданаие 1:
Мама купила 1 десяток яиц и еще 3 яйца.
Когда съели несколько яиц, то осталось 9 яиц.
Сколько яиц съели?
 */

//int mama = 10 + 3;
//int result = 9;
//int eat = mama - result;
//Console.WriteLine($"Съели {eat} яица");


/*      Задание 2:
Журнал имеет ширину 25см.
Он уже газеты на 16см.
Какой ширины газета?
 */

//int magazine = 25;
//int newspaper = magazine + 16;
//Console.WriteLine($"Газета шириной {newspaper} см");


/*      Задание 3:
Для приготовления обеда повару понадобилось 44 кг картошки, свеклы в 4 раза меньше, а лука в 2 раза меньше чем свеклы.
Сколько килограмм лука потратил повар?
 */

//double potato = 44;
//double beet = potato / 4;
//double onion = beet / 2;
//Console.WriteLine($"Повар потратил {onion} кг лука");
